#+TITLE: How to migrate a glusterfs brick to a new machine
#+AUTHOR: James Blair
#+EMAIL: mail@jamesblair.net
#+DATE: 23rd January 2021

For our Raspberry Pi cluster one of the maintenance tasks we want to be able to do whenever required is add a new machine to the cluster as a replacement for an existing machine. There could be a lot of reasons to do this, such as a hardware failure on an existing machine or wanting to do a rebuild of an existing machine.

On our Raspberry Pi cluster we run [[https://en.wikipedia.org/wiki/GlusterFS][GlusterFS]] for our scalable network attached storage with each machine in the cluster having a physical storage device attached (~/dev/sda1~). Currently we are using these [[https://www.pbtech.co.nz/product/HDDSEA0428/Seagate-4TB-Expansion-Portable-Hard-Drive][4TB external mechanical drives]] as they are a cost effective option for the bulk low performance storage required. Each machine formats their drive as ~xfs~ and mounts it to ~/data/brick1~.

If we want to swap a machine out of the cluster and replace it with a new one we need to be able to safely migrate a disk to the new machine and ensure we migrate the brick to the new server in ~glusterfs~. Below is a step by step guide on how to do this.

*Note:* This process has only been tested on a "quiet" cluster, i.e. where no / limited writes were occurring on the ~glusterfs~ cluster at the time. It may be best to stop the volume if that can't be guaranteed.


** Define connection variables

Firstly we need to connect to a peer in the glusterfs cluster that is NOT the machine we are going to remove in order to run the commands required to migrate a brick.

To save some time editing in future let's set some variables for the connection parameters we'll use.

#+NAME: Ip
#+BEGIN_SRC emacs-lisp :results silent
(setq machine_ip "192.168.1.124")
#+END_SRC

#+NAME: Port
#+BEGIN_SRC emacs-lisp :results silent
(setq machine_port "2124")
#+END_SRC

#+NAME: User
#+BEGIN_SRC emacs-lisp :results silent
(setq machine_user "james")
#+END_SRC

#+NAME: Sequence
#+BEGIN_SRC emacs-lisp :results silent
(setq knock_sequence "[SEQUENCE HERE]")
#+END_SRC

#+NAME: Confirm values
#+BEGIN_SRC shell :var ip=Ip port=Port user=User sequence=Sequence
echo "Machine IP:     $ip"
echo "Machine Port:   $port"
echo "Machine User:   $user"
echo "Knock sequence: $sequence"
#+END_SRC

#+RESULTS: Confirm values
#+begin_example
Machine IP:     "192.168.1.124"
Machine Port:   "2124"
Machine User:   "james"
Knock sequence: "[SEQUENCE HERE]"
#+end_example


